Repository: raf93278/Captain-Tsubasa
Catalog: omegat/project_save.tmx
Source language: en_gb
Languages: pl

source: The future has arrived!)
pl: Nadeszła przyszłość!)

source: The good fortune of meeting these two became the\nrobust roots of his passionate life of soccer.
pl: Spotkanie tej dwójki,\nstało się solidnymi korzeniami jego pasji do piłki nożnej.

source: The long pass makes it!
pl: Długie podanie!

# The look in your eyes was so intense that it really intimidated me.
source: The look in your eyes was so intense\nthat it really intimidated me.
pl: Spojrzenie w twoich oczach było tak intensywne, że naprawdę mnie przestraszyło.

# The lower middle of the screen shows the mini-map.
source: The lower middle of the screen shows the\nmini-map.
pl: W dolnej środkowej części ekranu wyświetlana jest\nmini-mapa.

source: The match is starting soon.
pl: Zaraz zacznie się mecz.

source: The most important thing is to not let the\nTachibanas get the ball, but if they do we'll\nneed to be extra careful.
pl: Najważniejszą rzeczą jest, by nie pozwolić\nTachibana przejąć piłkę, a jeśli to zrobią, będziemy musieli zachować szczególną ostrożność.

source: The nerve of this guy...
pl: Tupet tego gościa...

# The new Drive Shot was awesome enough and you went and outdid even that!
source: The new Drive Shot was awesome\nenough and you went and outdid even that!
pl: Nowy Drive Shot był już wystarczająco niesamowity, a ty przebiłeś nawet to!

source: The one and only.
pl: Jeden jedyny.

source: The only thing is...
pl: Jedyna rzecz to...

source: The power of two!
pl: Podwójna siła!

source: The previous year's champions Nankatsu are\nentering halftime with a lead over Otomo MS!
pl: Ubiegłoroczni mistrzowie Nankatsu mają do przerwy przewagę nad MS Otomo!

source: The same... probably.
pl: Ten sam... prawdopodobnie.

# The second match of the Junior Hero League is against Hanawa MS!
source: The second match of the Junior Hero League is\nagainst Hanawa MS!
pl: Drugi mecz Junior Hero League gramy z MS Hanawa!

source: The second match of the Junior\nHero League is against Otomo MS!\nThis team likes to use a certain strategy.
pl: W drugim meczu Junior\nHero League zmierzymy się z MS Otomo! Ta drużyna lubi stosować pewną strategię.

source: The sharp shift seems to come from the angle of\nthe upward spin and all the speed on the ball.
pl: Ostra zmiana wydaje się wynikać z kąta rotacji w górę i całej prędkości piłki.

source: The skies belong to me, Masao!
pl: Niebo należy do mnie, Masao!

source: The starting lineups for both teams are made up\nof some of the best players we've seen\nas far back as anyone can remember!
pl: Wyjściowe składy obu drużyn składają się z jednych z najlepszych zawodników,\njakich widzieliśmy, odkąd sięgamy pamięcią!

source: The table tennis just gave me a really\ngood idea and I wanna try it out right away.
pl: Tenis stołowy dał mi naprawdę dobry pomysł i chcę go natychmiast wypróbować.

source: The table tennis, he says.
pl: Tenis stołowy, mówisz.

# The tournament's barely started. Be sure you're staying ready and focused.
source: The tournament's barely started.\nBe sure you're staying ready and focused.
pl: Turniej dopiero się rozpoczął. Upewnij się, że jesteś gotowy i skoncentrowany.

# The twins' skilled coordination and acrobatic soccer will undoubtedly be strong.
source: The twins' skilled coordination\nand acrobatic soccer will undoubtedly be strong.
pl: Umiejętności bliźniaków w zakresie koordynacji i akrobatyki piłkarskiej będą niewątpliwie silne.

source: The winner of the Shizuoka Regionals is\nNankatsu MS for three years running!\nThey're headed to Nationals!
pl: Zwycięzcą zawodów prefektury Shizuoka jest\nMS Nankatsu już trzeci rok z rzędu!\nJadą na zawody krajowe!

# The winners of the Shizuoka Regionals are Otomo MS, led by Urabe!
source: The winners of the Shizuoka Regionals are\nOtomo MS, led by Urabe!
pl: Zwycięzcą zawodów prefektury Shizuoka jest\nMS Otomo, prowadzone przez Urabe!

# Their brains must work in an interesting way.
source: Their brains must work in an\ninteresting way.
pl: Ich mózgi muszą pracować w ciekawy sposób.

source: Their greatest asset is the Tachibana twins, who\nscore 90% of their goals.\nRepresenting Akita: Hanawa MS.
pl: Ich największym atutem są bliźniacy Tachibana, którzy zdobywają 90% swoich bramek. \nReprezentujący Akitę: MS Hanawa.

# Their leader! Our captain!
source: Their leader!\nOur captain!
pl: Ich przywódca!\nNasz kapitan!

# Their strategy prioritizes defense.
source: Their strategy prioritizes\ndefense.
pl: Ich strategia nadaje priorytet obronie.

# Then I can head to Brazil as soon as I finish middle school?
source: Then I can head to Brazil as soon as I\nfinish middle school?
pl: Zatem będę mógł pojechać do Brazylii, gdy tylko skończę liceum?

source: Then Nitta takes the ball, zips into position,\nand seals the deal with his Falcon Shot!
pl: Następnie Nitta przejmuje piłkę, doskakuje na pozycję i kończy zagranie swoim Falcon Shotem!

# Then again, it could also be that I've been training like mad ever since.
source: Then again, it could also be that I've been\ntraining like mad ever since.
pl: Z drugiej strony mogło być też tak, że od tamtej pory trenuję jak szalony.

# Then again, it could've been yesterday.
source: Then again, it could've been\nyesterday.
pl: Z drugiej strony, mogło to być wczoraj.

source: Then let's go with your plan.
pl: W takim razie zrealizujmy twój plan.

source: Then please let him play.
pl: Więc pozwól mu grać.

# Then, Takei frequently finishes the job with his powerful headers.
source: Then, Takei frequently finishes\nthe job with his powerful headers.
pl: Następnie Takei często kończy zadanie swoimi potężnymi główkami.

source: There are all sorts of rumors about this\nteam, but I don't know the truth about them.
pl: Krążą różne plotki na temat tego zespołu, ale nie znam prawdy na ich temat.

source: There are currently no custom players.
pl: Obecnie nie ma custom players.

source: There was a time you would've gone for the goal\neven if Misugi's heart had burst from his chest\nright there!
pl: Był taki czas, że strzeliłbyś gola nawet wtedy, gdyby serce Misugiego wyrwało mu się z klatki piersiowej!

source: There'll be no third point for you!
pl: Nie będzie dla ciebie trzeciego punktu!

source: There's no keeper I can't score on.
pl: Nie ma bramkarza, któremu nie mógłbym strzelić gola.

# There's no other way I can become a three-time national champion.
source: There's no other way I can become\na three-time national champion.
pl: Nie ma innego sposobu, w jaki mógłbym zostać trzykrotnym mistrzem kraju.

source: There's still something...)
pl: Jest jeszcze coś...)

# They haven't given up a single point this whole tournament.
source: They haven't given up a single point this whole\ntournament.
pl: W całym turnieju nie stracili ani jednego punktu.

source: They may be the best they've ever been.
pl: Mogą być najlepsi w historii.

# They specialize in the sliding plays they developed at Meiwa FC!
source: They specialize in the sliding plays they\ndeveloped at Meiwa FC!
pl: Specjalizują się w zagraniach ślizgowych, które opracowali w Meiwa FC!

# They were really proud of how well they emulated it.
source: They were really proud\nof how well they emulated it.
pl: Byli naprawdę dumni z tego, jak dobrze je odwzorowali.

# They'll be keeping an eye on our captain's long shot this time.
source: They'll be keeping an eye on our captain's long\nshot this time.
pl: Tym razem będą zwracać uwagę na strzał z dystansu naszego kapitana.

source: They're a lot like us!
pl: Są bardzo podobni do nas!

# They're a tricky team in the top eight.
source: They're a tricky team in the top\neight.
pl: To trudny zespół w pierwszej ósemce.

source: They're an incredibly defensive team that didn't\ngive up a single point in Osaka regionals.
pl: To niesamowicie defensywna drużyna, która nie oddała ani jednego punktu w regionalnym turnieju w Osace.

# They're another school from the final four at Nationals!
source: They're another school from the final four at\nNationals!
pl: Są kolejną szkołą z finałowej czwórki na mistrzostwach krajowych!

source: They're deep in enemy territory!
pl: Są głęboko na terytorium wroga!

source: They're led by Captain Urabe, who was Tsubasa's\nteammate back in elementary school.
pl: Dowodzi nimi kapitan Urabe, który był kolegą Tsubasy w szkole podstawowej.

source: They're passing back and forth!
pl: Przechodzą tam i z powrotem!

source: They're right in front of the goal!
pl: Są tuż przed bramką!

source: They're tightening up around the goal!
pl: Zacieśniają się wokół bramki!

source: They've a lot of talent.
pl: Mają mnóstwo talentów.

source: They've done it!
pl: Zrobili to!

# This game could've gone either way, folks, but Otomo MS just ran out of steam!
source: This game could've gone either way, folks,\nbut Otomo MS just ran out of steam!
pl: Ta gra mogła potoczyć się różnie, ale MS Otomo\npo prostu zabrakło pary!

source: This game uses auto-save.\nPlease be sure not to close the game or power off\nyour Nintendo Switch when the above icon\nis on the screen.
pl: Gra korzysta z automatycznego zapisu.\nPamiętaj, by nie zamykać gry ani nie wyłączać\n Nintendo Switch, gdy powyższa ikona jest widoczna na ekranie.

source: This game uses auto-save.\nPlease be sure not to close the game or power off\nyour PC when the above icon is on the screen.
pl: Gra korzysta z automatycznego zapisu.\nPamiętaj, by nie zamykać gry ani nie wyłączać\nkomputera, gdy powyższa ikona jest widoczna na ekranie.

source: This game uses auto-save.\nPlease be sure not to close the game or power off\nyour PlayStation<rep Registered>4 System when the\nabove icon is on the screen.
pl: Gra korzysta z automatycznego zapisu.\nPamiętaj, by nie zamykać gry ani nie wyłączać\nPlayStation<rep Registered>4 System, gdy powyższa ikona jest widoczna na ekranie.

source: This gave their forward, Nitta, the chance to score\ngoal after goal, carrying them through the\ntournament like clockwork.
pl: To dało ich napastnikowi, Nitcie, szansę na strzelanie gola za golem, prowadząc ich przez turniej jak w zegarku.

source: This is a duo's strength!
pl: To jest siła duetu!

source: This is all my fault!
pl: To moja wina!

source: This is bad!
pl: Jest źle!

source: This is every ounce of shot I got!
pl: To cała siła. którą włożę w ten strzał!

source: This is it!
pl: To jest to!

# This is it, folks! Honma versus Wakashimazu!
source: This is it, folks!\nHonma versus Wakashimazu!
pl: To jest to, ludzie! Honma kontra Wakashimazu!

source: This is our combined strength!
pl: To nasza połączona siła!

source: This is our time.)
pl: To nasz czas.)

source: This is truly a showdown for the ages, folks!
pl: To naprawdę wiekowe starcie.

source: This isn't good, guys!
pl: Nie jest dobrze, chłopaki!

source: This one's mine, Jean!
pl: Ta jest moja, Jean!

source: This practice sums up the most important\nparts, so you can better enjoy\nFreestyle Matches.
pl: Ta praktyka podsumowuje najważniejsze części, dzięki czemu możesz lepiej cieszyć się\n meczami Freestyle.

source: This still won't cut it.)
pl: To nadal nie wystarczy).

# This time Hyuga joined Genzo in asking to play against you.
source: This time Hyuga joined Genzo in asking to play\nagainst you.
pl: Tym razem Hyuga dołączył do Genzo, prosząc o grę przeciwko tobie.

source: This win is mine!
pl: Ta wygrana jest moja!

source: This won't be easy, but our opponents\nmust be feeling the pressure, as well.\nGather your courage and face them!
pl: Nie będzie to łatwe, ale nasi przeciwnicy również muszą odczuwać presję. Zbierzcie się na odwagę i stawcie im czoła!

# This year, we're stepping right over them and heading to Nationals!
source: This year, we're stepping right over them\nand heading to Nationals!
pl: W tym roku pokonamy je\ni ruszamy na mistrzostwa krajowe!

source: This'll probably be a tough game where we'll need\nto keep them from controlling the match with\ntheir aerial soccer.
pl: To prawdopodobnie będzie trudny mecz, w którym będziemy musieli uniemożliwić im kontrolowanie meczu za pomocą ich powietrznej piłki.

source: Those are some moves, Klismann!
pl: Niezłe ruchy, Klismann!

# Those gave us a tough time back in elementary school, so watch out!
source: Those gave us a tough\ntime back in elementary school, so watch out!
pl: Sprawiły, że w szkole podstawowej\nbyło nam ciężko, więc uważaj!

source: Though the Drive Shot has the advantage of flying\nabove the goalie if his positioning's bad.
pl: Chociaż Drive Shot ma tę zaletę, że leci nad bramkarzem, jeśli ten źle się ustawi.

source: Though what you're going for seems like\na solid concept given how good the shot is\nalready and how it feels.
pl: To do czego zmierzasz, wydaje się być solidną koncepcją,\nbiorąc pod uwagę, jak dobry jest już strzał i jakie robi wrażenie.

source: Time to break away!
pl: Czas się wyrwać!

source: Time to fly!
pl: Czas lecieć!

source: Time to give up your plans, Pierre!
pl: Czas porzucić plany, Pierre!

source: Time to pull out all the stops!
pl: Czas przestać się wstrzymywać!

source: Time to take back the game!
pl: Czas odzyskać kontrolę nad grą!

source: To tell the truth, the person behind the\ngame is someone I've been friends with since\nelementary school.
pl: Prawdę mówiąc, osobą stojącą za tą grą\njest ktoś, z kim przyjaźnię się od czasów szkoły podstawowej.

# Today, he's a two-time national middle school champion.)
source: Today, he's\na two-time national middle school champion.)
pl: Dziś jest dwukrotnym mistrzem kraju w liceum.)

source: Today, we win.
pl: Dziś wygramy.

# Today, we're going home winners! Let's do it!
source: Today, we're going home winners!\nLet's do it!
pl: Dziś wrócimy do domu jako zwycięzcy!\nDo dzieła!

source: Together now!
pl: Teraz razem!

# Toho is going to Nationals for the third year in a row!
source: Toho is going to Nationals\nfor the third year in a row!
pl: Toho jedzie na zawody krajowe trzeci rok z rzędu!

# Toho made it this far without relying on their ace Hyuga this time.
source: Toho made\nit this far without relying on their ace Hyuga\nthis time.
pl: Toho udało się zajść tak daleko bez polegania na swoim asie Hyudze.

source: True.
pl: Prawda.

source: Trust me!
pl: Zaufajcie mi!

source: Try a little harder, Kaltz!
pl: Postaraj się bardziej, Kaltz!

# Tsubasa Ozora. He's grown quite a bit since I last saw him.
source: Tsubasa Ozora.\nHe's grown quite a bit since I last saw him.
pl: Tsubasa Ozora.\nUrósł, odkąd go ostatni raz widziałem.

source: Tsubasa had competition in elementary school.\nBut in these past two years,\nhis talent has dwarfed theirs considerably.
pl: Tsubasa miał konkurencję w szkole podstawowej, ale w ciągu\nostatnich dwóch lat jego talent znacznie przewyższył ich talent.

source: Tsubasa only
pl: Tylko Tsubasa

source: Tsubasa owes him a lot.
pl: Tsubasa dużo mu zawdzięcza.

# Tsubasa. We did what we could, but...
source: Tsubasa.\nWe did what we could, but...
pl: Tsubasa.\nZrobiliśmy, co mogliśmy, ale...

source: Turns out we weren't a match for you.
pl: Okazało się, że nie pasowaliśmy do ciebie.

source: Tutorial
pl: Samouczek

source: Tutorial Challenges
pl: Wyzwania samouczka

source: Two story campaigns are now playable: "EPISODE: TSUBASA" and "EPISODE: NEW HERO"
pl: Dostępne są już dwie kampanie fabularne: "EPIZOD: TSUBASA" i "EPIZOD: NOWY BOHATER"

source: Ugh, nice play, Leo!
pl: Niezłe zagranie, Leo!

source: Uh, yeah.
pl: Uh, tak.

# Um, by "soccer-based game," does that mean it's not actually a soccer game?
source: Um, by "soccer-based game," does that mean\nit's not actually a soccer game?
pl: Hm, czy określenie „gra oparta na piłce nożnej”\noznacza, że tak naprawdę nie jest to gra w piłkę nożną?

source: Undergo training to learn useful skills.
pl: Przejdź szkolenie, by nauczyć się przydatnych umiejętności.

source: Unpause and return to dialogue.
pl: Wyłącz pauzę i wróć do dialogu.

source: Up to now, our opponents in this\ntourney have been nothing special,\nbut Otomo is a different story!
pl: Do tej pory nasi przeciwnicy w tym turnieju nie byli niczym specjalnym, ale Otomo to zupełnie inna historia!

# Up to two players can battle offline with Versus Match.
source: Up to two\nplayers can battle offline with\nVersus Match.
pl: W Versus Match// maksymalnie. dwóch graczy\n może walczyć w trybie offline.

source: Urabe and the others in the Otomo Quartet take\nover the midfield, where they steal the ball\nand send it ahead with a long pass!
pl: Urabe i pozostali członkowie kwartetu Otomo kierują się na środek boiska, gdzie kradną piłkę i posyłają ją do przodu długim podaniem!

source: Urabe, that all you got?
pl: Urabe, tylko na tyle cię stać?

source: Use Captain Coins to buy customization parts, etc.
pl: Użyj Captain Coins, aby kupić części do personalizacji itp.

source: Use item
pl: Użyj przedmiot

source: View each team's members' stats.
pl: Wyświetl statystyki członków każdej z drużyn.

source: View the moves of each team's players.
pl: Wyświetl ruchy zawodników każdej z drużyn.

source: View the skills each team's players.
pl: Wyświetl umiejętności zawodników każdej z drużyn.

source: Wait, Soda, you play table tennis, too?
pl: Czekaj, Soda, też grasz w tenisa stołowego?

source: Wait, Tsubasa, you're too far back...
pl: Czekaj, Tsubasa, jesteś za daleko z tyłu...

source: Waiting for Player
pl: Czekanie na gracza

source: Wakashimazu dives for it with everything he's got!
pl: Wakashimazu dives// ze wszystkich sił, jakie ma!

source: Wakashimazu stopped it!
pl: Wakashimazu to zatrzymał!

source: Was that my voice just now?
pl: Czy to był mój głos?

source: Was there even a point to doing all that?
pl: Czy było w ogóle sens robić to wszystko?

# Watching for this counterattack is our top priority!
source: Watching\nfor this counterattack is our top priority!
pl: Obserwowanie tego kontrataku jest naszym najwyższym priorytetem!

source: We can expect a fierce battle start to finish!
pl: Możemy spodziewać się zaciętej bitwy od początku do końca!

source: We can talk Brazil after.
pl: Po wszystkim możemy porozmawiać o Brazylii.

source: We can't afford to let our guard down.
pl: Nie możemy pozwolić sobie na utratę czujności.

source: We can't find Hyuga!
pl: Nie możemy znaleźć Hyugi!

source: We defend and you score.
pl: My bronimy, a wy zdobywacie gole.

# We finally made it to the semifinals! Our opponent is Furano MS from Hokkaido.
source: We finally made it to the semifinals!\nOur opponent is Furano MS from Hokkaido.
pl: W końcu dotarliśmy do półfinału! Naszym przeciwnikiem jest MS Furano z Hokkaido.

source: We just couldn't make it happen!
pl: Po prostu nie mogliśmy tego zrobić!

source: We just need to stick to the basics of Furano\nsoccer, and use our passing and dribbling\nto keep pushing forward with teamwork.
pl: Musimy po prostu trzymać się podstaw gry Furano w\npiłce nożnej i wykorzystywać podania i drybling,\nby kontynuować pracę zespołową.

# We keep the brothers grounded, and we have nothing to fear!
source: We keep the brothers grounded, and we have\nnothing to fear!
pl: Trzymając braci na ziemi i nie musimy się niczego obawiać!

# We keep up the defense until you find your opening to score in the second half.
source: We keep up the defense\nuntil you find your opening to score in the\nsecond half.
pl: Utrzymujemy obronę, dopóki nie znajdziesz swojej\nszansy na zdobycie gola w drugiej połowie.

source: We let them take the lead!
pl: Pozwoliliśmy im przejąć inicjatywę!

# We lost. Nankatsu was just too strong after all.
source: We lost.\nNankatsu was just too strong after all.
pl: Przegraliśmy. Nankatsu było po prostu zbyt silne.

source: We made it to the quarterfinals...
pl: Dotarliśmy do ćwierćfinałów...

# We need to watch out for two players: Masao and Kazuo Tachibana.
source: We need to watch out for two players: Masao and\nKazuo Tachibana.
pl: Musimy uważać na dwóch graczy: Masao i\nKazuo Tachibana.

# We play defensive. Being tied just means they're right where we want them.
source: We play defensive.\nBeing tied just means they're right where we want\nthem.
pl: Gramy defensywnie, a remis oznacza, że są dokładnie tam, gdzie chcemy.

source: We practice in the gym on rainy days.
pl: W deszczowe dni trenujemy na sali gimnastycznej.

source: We scored!
pl: Zdobyliśmy bramkę!

# We should definitely keep an eye on the defender, Soda.
source: We should definitely keep an eye on the defender,\nSoda.
pl: Zdecydowanie powinniśmy mieć oko na obrońcę, Soda.

source: We should watch out for the ground-crawling\nlong shot he used in the quarterfinals, too.
pl: Powinniśmy również uważać na długi strzał, którego użył w ćwierćfinale.

source: We start real early tomorrow.
pl: Jutro zaczynamy bardzo wcześnie.

source: We stick to the plan.
pl: Trzymamy się planu.

# We were like shadows. We were nothing.)
source: We were like shadows.\nWe were nothing.)
pl: Byliśmy jak cienie. Byliśmy niczym).

# We'll be bringin' Nankatsu's triple victory journey to a close.
source: We'll be bringin'\nNankatsu's triple victory journey to a close.
pl: Potrójne zwycięstwo Nankatsu dobiegnie końca.

# We'll be in trouble if we just keeping passing it to him like before.
source: We'll be in trouble if we just\nkeeping passing it to him like before.
pl: Będziemy w tarapatach, jeśli będziemy podawać mu piłkę tak jak wcześniej.

# We'll be up against Otomo, and they've just been getting better and better.
source: We'll be up against Otomo,\nand they've just been getting better and better.
pl: Zmierzymy się z Otomo, a oni stają się coraz lepsi.

source: We'll have to figure out in-game how to slip\npast the Otomo Quartet or upset Nitta's offense.
pl: Będziemy musieli wymyślić w grze, jak ominąć kwartet Otomo lub zdenerwować ofensywę Nitty.

# We'll need to watch out for his speed and his special Falcon Shot.
source: We'll need to watch\nout for his speed and his special Falcon Shot.
pl: Musimy uważać na jego szybkość i specjalny Falcon Shot.

source: We're counting on you.
pl: Liczymy na ciebie.

# We're finally entering the endgame of the Tokyo Regional finals!
source: We're finally entering the endgame of the Tokyo\nRegional finals!
pl: W końcu wkraczamy w fazę końcową\nfinałów regionalnych w Tokio!

source: We're going all the way!
pl: Idziemy na całość!

# We're going for victory number three at Nationals!
source: We're going for victory number three at\nNationals!
pl: Dążymy do trzeciego zwycięstwa w\nmistrzostwach krajowych!

source: We're in the lead!
pl: Prowadzimy!

source: We're in total control!
pl: Mamy pełną kontrolę!

# We've finally made it to the finals of the Shizuoka regionals.
source: We've finally made it to the finals of the\nShizuoka regionals.
pl: W końcu dotarliśmy do finałów w prefekturze Shizuoka.

source: We've got clear summer skies here in Shizuoka,\nas the regional soccer tournament\nis finally getting underway!
pl: W Shizuoce mamy czyste letnie niebo, a regionalny\nturniej piłki nożnej wreszcie się rozpoczyna!

# We've worked so hard this past year, and all to take down Nankatsu.
source: We've worked so hard this past year, and all to\ntake down Nankatsu.
pl: Przez ostatni rok ciężko pracowaliśmy, a wszystko po to, aby pokonać Nankatsu.

source: Well done.
pl: Dobra robota.

source: Well played, Kaiser!
pl: Dobrze zagrane, Kaiser!

source: Well played.
pl: Dobrze rozegrane.

# Well, I can say a soccer player like that you only see once in a generation.
source: Well, I can say a soccer player like\nthat you only see once in a generation.
pl: Cóż, mogę powiedzieć, że takiego\npiłkarza widzi się tylko raz na pokolenie.

source: Well, don't think I'm gonna let it happen again.
pl: Nie myśl, że pozwolę, aby to się powtórzyło.

source: Well, haven't you become warm and fuzzy, Kojiro?
pl: Czyż nie stałeś się ciepły i rozmarzony, Kojiro?
